a = float(input())
ptrl = a * 3.78541
oil = a / 19.5
burn = a * 19.6
eqv = a * 115000 / (a / 1.5 *  75700)
s = a * 3
nov = 1940000 / 365
rus = 59800000
print ('объем бензина (в литрах)' , ptrl)
print ('количество баррелей нефти' , oil)
print ('объем углекислого газа при сжигании в двигателе этого бензина (в фунтах)' , burn)
print ('эквивалентный объем этанола (в галлонах):' , eqv)
print ('стоимость в долларах США:' , s)
print('примерный расход бензина (в литрах) для Новосибирска в день:' , nov)
print('примерный расход бензина (в литрах) по России в год:' , rus)